---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager
source: html/0f7f395b-3f70-aa6e-e584-b70c11f767ad.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager

Class which manages the associations between analytical elements and physical elements.

## Syntax (C#)
```csharp
public class AnalyticalToPhysicalAssociationManager : Element
```

## Remarks
An element can be part of only one association at a time.
 Physical elements can have one of these categories:
 Columns Curtain Wall Panels Floors Generic Models Mass Parts Railings Ramps Roofs Stairs Structural Columns Structural Foundation Structural Framing Structural Trusses Structural Beam System Walls
 Analytical elements can have one of these categories:
 Analytical Member Analytical Panel